controllers/DefaultController.php

SELECT `id` FROM `products` WHERE `delivery_id`=8
SELECT COUNT(*) FROM `pk_orders` WHERE `status` IN (1, 2, 3)
SELECT COUNT(*) FROM `orders` WHERE (`status` IN (1, 2, 3)) AND (`product_id` IN ('90', '141', '142', '143'))
SELECT COUNT(*) FROM `jdcard_buyback_list` WHERE `pay_status`=2
---
	public function actionIndex()
	{
        //查询商品
        $jdproductlist= Product::find()->select('id')->where(['delivery_id'=>8])->asArray()->all();
        $jdid_list=[];
        foreach($jdproductlist as $row)
        {
            $jdid_list[]=$row['id'];               //所有京东商品
        }
        //查询是否有未处理的订单
        $oderstatus=[1,2,3];
        $pkorder=PkOrders::find()->where(['status'=>$oderstatus])->count();
        $order=Order::find()->where(['status'=>$oderstatus,'product_id'=>$jdid_list])->count();
        $jdback=JdcardBuybackList::find()->where(['pay_status'=>2])->count();

SELECT * FROM `admin` WHERE `id`='82'
---
	public function actionGetMenu()
	{
		$adminid = Yii::$app->admin->id;
		$admin = Admin::findOne($adminid);