controllers/JdcardbuybackController.php

SELECT COUNT(*) FROM `jdcard_buyback_mobile`
SELECT * FROM `jdcard_buyback_mobile` ORDER BY `id` DESC LIMIT 10
SELECT `pay_status`, `mobile`, `face_value`, count(*) as nums FROM `jdcard_buyback_list` WHERE `mobile`='13787734401' GROUP BY `face_value`, `pay_status`
---
    public function actionMobileList()
    {

        $request = \Yii::$app->request;
        if ($request->isAjax || $request->get('excel') == 'virtual') {
            $page = $request->get('page', 1);
            $perpage = $request->get('row', 10);

            $mobilecount = JdcardBuybackMobile::find()->count();
            $pagination = new Pagination(['totalCount' => $mobilecount, 'page' => $page - 1, 'defaultPageSize' => $perpage]);
            $mobilelist = JdcardBuybackMobile::find()->offset($pagination->offset)
                ->limit($pagination->limit)
                ->orderBy('id desc')->asArray()
                ->all();

            if ($mobilelist) {
                foreach ($mobilelist as &$row) {
                    //根据商品id 查询面额
                    $mobileModel = JdcardBuybackList::find();
                    $mobileModel->select(['pay_status', 'mobile', 'face_value', 'count(*) as nums']);
                    $mobileModel->groupBy(['face_value', 'pay_status']);
                    $mobileModel->where(['mobile' => $row['mobile']]);
                    $order_face = $mobileModel->asArray()->all();

SELECT * FROM `admin` WHERE `id`=224
---
                        if($action_log)
                        {
                            if(!empty($action_log['log_status2'])){
                                $beihuo=Admin::findOne($action_log['log_status2']['admin_id']);

SELECT * FROM `admin` WHERE `id`=168
---
                                $row['beihuo']='无';
                            }
                            if(!empty($action_log['log_status1'])){
                               $fahuo=Admin::findOne($action_log['log_status1']['admin_id']);

SELECT * FROM `periods` WHERE `id`='5337'
---
                        $row['pay_time'] = date('Y-m-d h:i:s', $row['pay_time']);
                        //根据订单查询中奖时间
                        if($row['order_type']==0){
                            $wintime=Period::findOne($row['period_id']);

SELECT * FROM `pk_orders` WHERE `id`='125'
SELECT * FROM `periods` WHERE `id`='5337'
---
                        }
                        //查询期号
                        if ($row['order_type'] == '活动:PK场') {
                         $period= PkOrders::findOne($row['period_id']);
                        } else {
                         $period= Period::findOne($row['period_id']);

SELECT * FROM `periods` WHERE `id`='125'
SELECT * FROM `pk_periods` WHERE `id`='125'
---

            foreach ($Buybacklist as &$row){
                if($row['order_type']==0){
                  $periodinfo= Period::findOne($row['period_id']);

                }
                else if($row['order_type']==1){
                    $periodinfo=PkPeriods::findOne($row['period_id']);

SELECT * FROM `admin` WHERE `id`='83'
---
                //添加备货人
                $action_log=json_decode($row['action_log'],1);
                if(isset($action_log['log_status2'])){
                $beihuo=Admin::findOne($action_log['log_status2']['admin_id']);

SELECT * FROM `jdcard_buyback_list` WHERE `id`='56'
---

        } else {
            if ($id) {
                $Buyback = JdcardBuybackList::findOne($id)->toArray();

SELECT * FROM `orders` WHERE `id`=249
---
                    }

                }else{
                    $order=Order::findOne($Buyback['order_id']);

SELECT * FROM `users` WHERE `id`=669768
---
                } else {
                    $smaty = 'add_pay';
                    //查询用户昵称和手机
                    $userinfo = User::findOne($Buyback['user_id'])->toArray();