controllers/LoginController.php

    public function actionIndex()
    {
        $admin = Yii::$app->admin;
        $request = Yii::$app->request;
        if (!$admin->isGuest) {
            return $this->redirect(['default/index']);
        }
        $smscode = $request->post('yzm');
        //根据用户查询手机号
        $name = $request->post('LoginForm')['username'];

        $admininfo = Admin::find()->where(['username' => $name])->asArray()->one();
---
SELECT * FROM `admin` WHERE `username` IS NULL

                    if ($model->login()) {
                        $ip = Yii::$app->request->AdminIP;
                        //登录成功 修改登录时间与登录地址
                        $adminObj = Admin::findOne($model->getAdmin()->id);
                        $adminObj->login_at = time();
                        $adminObj->login_ip = $ip;
                        $adminObj->updated_at = time();
---
SELECT * FROM `admin` WHERE `id`='82'
UPDATE `admin` SET `updated_at`='1471396105', `login_at`=1471396105 WHERE `id`='82'