models/Admin.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `admin` WHERE `id`='82'

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => 0]);
---
SELECT * FROM `admin` WHERE (`username`='joan') AND (`status`=0)